ke_model/base_steady/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inletBoundary_patch0
    {
        // according to https://github.com/meinarsve/CFDwOpenFoam
        type            zeroGradient;
        // type            fixedValue;
        // value           uniform 0;
    }
    outletBoundary_patch2
    {
        type            fixedValue;
        value           uniform  0;
    }


    fixedWalltop_patch1
    {
        type zeroGradient;
    }
    fixedWallbot_patch1
    {
        type zeroGradient;
    }


    cyc_halftop_patch2
    {
        type            cyclicAMI;
    }
    cyc_halfbot_patch2
    {
        type            cyclicAMI;
    }

    cyc_halftop_patch0
    {
        type            cyclicAMI;
    }
    cyc_halfbot_patch0
    {
        type            cyclicAMI;
    }

    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}

// ************************************************************************* //
